; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p16---int100n150-m25---int100c110---s330---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level9 level9)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level9 level10)
(sum level2 level1 level3)
(sum level2 level9 level11)
(sum level3 level1 level4)
(sum level3 level9 level12)
(sum level4 level1 level5)
(sum level4 level9 level13)
(sum level5 level1 level6)
(sum level5 level9 level14)
(sum level6 level1 level7)
(sum level6 level9 level15)
(sum level7 level1 level8)
(sum level7 level9 level16)
(sum level8 level1 level9)
(sum level8 level9 level17)
(sum level9 level1 level10)
(sum level9 level9 level18)
(sum level10 level1 level11)
(sum level10 level9 level19)
(sum level11 level1 level12)
(sum level11 level9 level20)
(sum level12 level1 level13)
(sum level12 level9 level21)
(sum level13 level1 level14)
(sum level13 level9 level22)
(sum level14 level1 level15)
(sum level14 level9 level23)
(sum level15 level1 level16)
(sum level15 level9 level24)
(sum level16 level1 level17)
(sum level16 level9 level25)
(sum level17 level1 level18)
(sum level18 level1 level19)
(sum level19 level1 level20)
(sum level20 level1 level21)
(sum level21 level1 level22)
(sum level22 level1 level23)
(sum level23 level1 level24)
(sum level24 level1 level25)

(connected l0 l1)
(fuelcost level9 l0 l1)
(connected l0 l2)
(fuelcost level25 l0 l2)
(connected l1 l0)
(fuelcost level9 l1 l0)
(connected l1 l2)
(fuelcost level1 l1 l2)
(connected l2 l0)
(fuelcost level25 l2 l0)
(connected l2 l1)
(fuelcost level1 l2 l1)

(at t0 l2)
(fuel t0 level22)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l0)
(at p3 l1)
(at p4 l0)
(at p5 l0)
(at p6 l1)
(at p7 l1)
(at p8 l1)
(at p9 l1)
(at p10 l2)
(at p11 l0)
(at p12 l0)
(at p13 l2)
(at p14 l2)
(at p15 l1)
)

(:goal
(and
(at p0 l2)
(at p1 l1)
(at p2 l2)
(at p3 l2)
(at p4 l1)
(at p5 l2)
(at p6 l0)
(at p7 l2)
(at p8 l2)
(at p9 l2)
(at p10 l1)
(at p11 l2)
(at p12 l1)
(at p13 l1)
(at p14 l0)
(at p15 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p14 t0 l2)
   deleted: (at p14 l2)
   added: (in p14 t0)
   goals met: 0 of 16
2. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 0 of 16
3. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 0 of 16
4. (drive t0 l2 l1 level21 level1 level22)
   deleted: (at t0 l2) (fuel t0 level22)
   added: (at t0 l1) (fuel t0 level21)
   goals met: 0 of 16
5. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 16
6. (load p15 t0 l1)
   deleted: (at p15 l1)
   added: (in p15 t0)
   goals met: 0 of 16
7. (drive t0 l1 l0 level12 level9 level21)
   deleted: (at t0 l1) (fuel t0 level21)
   added: (at t0 l0) (fuel t0 level12)
   goals met: 0 of 16
8. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 1 of 16
9. (unload p15 t0 l0)
   deleted: (in p15 t0)
   added: (at p15 l0)
   goals met: 2 of 16
10. (unload p14 t0 l0)
   deleted: (in p14 t0)
   added: (at p14 l0)
   goals met: 3 of 16
11. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 3 of 16
12. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 3 of 16
13. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 3 of 16
14. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 3 of 16
15. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 3 of 16
16. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 3 of 16
17. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 3 of 16
18. (drive t0 l0 l1 level3 level9 level12)
   deleted: (at t0 l0) (fuel t0 level12)
   added: (at t0 l1) (fuel t0 level3)
   goals met: 3 of 16
19. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 4 of 16
20. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 5 of 16
21. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 6 of 16
22. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 7 of 16
23. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 8 of 16
24. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 8 of 16
25. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 8 of 16
26. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 8 of 16
27. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 8 of 16
28. (drive t0 l1 l2 level2 level1 level3)
   deleted: (at t0 l1) (fuel t0 level3)
   added: (at t0 l2) (fuel t0 level2)
   goals met: 8 of 16
29. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 9 of 16
30. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 10 of 16
31. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 11 of 16
32. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 12 of 16
33. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 13 of 16
34. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 14 of 16
35. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 15 of 16
36. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 16 of 16
